scripts/mutations/m02-permissions-viewer-invert.patch
# 変異 2: permissions-viewer-invert
#
# 検出を期待するテスト:
#   - packages/core/test/permissions-differential.test.ts
#   - packages/core/test/permissions.test.ts
#
# 適用: リポジトリルート（/workspaces/claym/local/Tasuki）から
#       git apply tdd-mob-pro-timer/scripts/mutations/m02-*.patch
#       (diff のパスは tdd-mob-pro-timer/... 起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/tdd-mob-pro-timer/packages/core/src/permissions.ts b/tdd-mob-pro-timer/packages/core/src/permissions.ts
index 565ee8a..d3b5373 100644
--- a/tdd-mob-pro-timer/packages/core/src/permissions.ts
+++ b/tdd-mob-pro-timer/packages/core/src/permissions.ts
@@ -187,7 +187,7 @@ export function checkPermission(input: PermissionInput): PermissionVerdict {
   }
 
   // ステップ3: 見学者は状態変更操作を実行できない（自己対象はステップ1で既に処理済み）。
-  if (role === "viewer") {
+  if (role !== "viewer") {
     return denied(`${command} は見学者では実行できません（進行に加わると実行できます）`);
   }
 
