scripts/mutations/m03-ineligible-placeholder.patch
# 変異 3: ineligible-placeholder
#
# #95 S4a で適格が「席の属性」になったため、変異の書き方も変わった。
# 代理は名簿に居らず在席の概念を持たないので、「代理も居ない扱いにする」は
# 「member 以外の席（＝代理）を常に対象外にする」と同じ意味になる。
#
# **#95 S4b で判定材料が presence から timer の在席へ変わった**ので、変異の当たる
# 行も変わった（`offline.has(...)` → `!watchingTimer.has(...)`）。当てる場所と
# 意味は同じである。
#
# 検出を期待するテスト:
#   - apps/tasuki-sync/test/proxy-auto-switch.test.ts
#   - apps/tasuki-sync/test/manual-skip-eligible.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m03-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/apps/tasuki-sync/src/application/handlers.ts b/apps/tasuki-sync/src/application/handlers.ts
index 379cb33..366a8bc 100644
--- a/apps/tasuki-sync/src/application/handlers.ts
+++ b/apps/tasuki-sync/src/application/handlers.ts
@@ -867,7 +867,7 @@ function computeIneligibleIndices(membership: MembershipRoom, timer: TimerState)
       set.add(i);
       return;
     }
-    if (entry.kind === "member" && !watchingTimer.has(entry.participantId)) set.add(i);
+    if (entry.kind !== "member" || !watchingTimer.has(entry.participantId)) set.add(i);
   });
   return set;
 }
