scripts/mutations/m22-plan-gate-principles-unchecked.patch
diff --git a/scripts/audit-plan-gate.mjs b/scripts/audit-plan-gate.mjs
index 0525344..275f631 100644
--- a/scripts/audit-plan-gate.mjs
+++ b/scripts/audit-plan-gate.mjs
@@ -167,16 +167,6 @@ export function findGateSections(text) {
 /** 1 つの候補節が要求を満たしているか。 */
 function evaluateSection(rel, section, principles) {
   const problems = [];
-  const missing = principles
-    .filter(({ numeral }) => !new RegExp(`^\\|\\s*${numeral}\\.\\s`, "m").test(section))
-    .map(({ numeral }) => numeral);
-  if (missing.length > 0) {
-    problems.push({
-      file: rel,
-      message: `判定表に無い原則があります: ${missing.join(" / ")}    ← 憲法の全原則について「通過 / 該当なし / 逸脱」を書いてください`,
-    });
-  }
-
   // **表のセルで満たさせない。** `| I. x | 通過 | 逸脱なし |` の 1 行だけで結論の要求が
   // 満たせてしまうと、節全体の判断を書かずに通る（レビューで実測。問題 0 件で通った）。
   const hasConclusion = section
