scripts/mutations/m04-display-name-control-chars.patch
# 変異 4: display-name-control-chars
#
# 検出を期待するテスト:
#   - packages/timer-core/test/display-name.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m04-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/packages/timer-core/src/display-name.ts b/packages/timer-core/src/display-name.ts
index 7069f28..76834fe 100644
--- a/packages/timer-core/src/display-name.ts
+++ b/packages/timer-core/src/display-name.ts
@@ -130,7 +130,6 @@ function stripLabelMarkers(input: string): string {
  */
 export function normalizeDisplayName(raw: string): string {
   return stripLabelMarkers(raw.normalize("NFKC").replace(INVISIBLE_FORMAT, ""))
-    .replace(CONTROL_CHARS, "")
     .replace(/\s+/g, " ")
     .trim();
 }
