scripts/mutations/m04-display-name-control-chars.patch
# 変異 4: display-name-control-chars
#
# 検出を期待するテスト:
#   - packages/room-core/tests/display-name.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m04-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/packages/room-core/src/display-name.ts b/packages/room-core/src/display-name.ts
index 7c68896..08202bc 100644
--- a/packages/room-core/src/display-name.ts
+++ b/packages/room-core/src/display-name.ts
@@ -261,7 +261,7 @@ function stripLabelMarkersOnce(input: string): string {
  */
 export function normalizeDisplayName(raw: string): string {
   return stripLabelMarkers(
-    raw.normalize("NFKC").replace(INVISIBLE_FORMAT, "").replace(CONTROL_CHARS, ""),
+    raw.normalize("NFKC").replace(INVISIBLE_FORMAT, ""),
   )
     .replace(/\s+/g, " ")
     .trim()
