tdd-mob-pro-timer/scripts/mutations/m05-can-remove-participant-guard.patch
# 変異 5: can-remove-participant-guard
#
# 検出を期待するテスト:
#   - apps/sync/test/participant-remove.test.ts
#
# 適用: リポジトリルート（/workspaces/claym/local/Tasuki）から
#       git apply tdd-mob-pro-timer/scripts/mutations/m05-*.patch
#       (diff のパスは tdd-mob-pro-timer/... 起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts b/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts
index 124c466..9517751 100644
--- a/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts
+++ b/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts
@@ -470,7 +470,7 @@ export function makeHandlers(deps: HandlerDeps) {
       }
       // 不変条件: 実在（非代理）の編集者以上が1名以上残ること（FR-072/073）。
       // 権限ではなくドメインガードなので checkPermission とは別に検査する（plan.md D3）。
-      if (!canRemoveParticipant(targetRoom.participants, targetId)) {
+      if (false) {
         broadcaster.sendTo(connId, {
           type: "error",
           code: "LAST_MANAGER",
