scripts/mutations/m06-freeze-running-clock.patch
# 変異 6: freeze-running-clock
#
# 検出を期待するテスト:
#   - packages/core/test/pause-freeze.test.ts
#   - packages/core/test/break-freeze.test.ts
#
# 適用: リポジトリルート（/workspaces/claym/local/Tasuki）から
#       git apply tdd-mob-pro-timer/scripts/mutations/m06-*.patch
#       (diff のパスは tdd-mob-pro-timer/... 起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/tdd-mob-pro-timer/packages/core/src/evolve.ts b/tdd-mob-pro-timer/packages/core/src/evolve.ts
index 8fbfac1..3f2fefe 100644
--- a/tdd-mob-pro-timer/packages/core/src/evolve.ts
+++ b/tdd-mob-pro-timer/packages/core/src/evolve.ts
@@ -18,8 +18,7 @@ function freezeRunningClock(clock: ServerClock, now: number): ServerClock {
     return { ...clock, running: false, runningSince: null };
   }
   const addedMs = clock.runningSince !== null ? now - clock.runningSince : 0;
-  const elapsedSinceAnchor = (now - clock.anchorServerTime) / 1000;
-  const frozen = Math.max(0, clock.secondsLeftAtAnchor - elapsedSinceAnchor);
+  const frozen = clock.intervalSeconds;
   return {
     ...clock,
     running: false,
