scripts/mutations/m07-generating-guesses-when-ledger-missing.patch
# 変異 7: generating-guesses-when-ledger-missing
#
# 帳簿（Room.problemGeneration）を持たない snapshot を「生成中」側へ倒す。
# 配布の窓（新しい画面 × 旧サーバー）では、お題パネル全体が
# opacity-50 + pointer-events: none で固まり、**降ろす者が誰も居ない**。
#
# #283 より前、ここには「内容差分で生成中を降ろす」変異（shouldClearGenerating の
# 参照比較化）があった。その関数ごと消えたので、同じ欠陥の新しい住所へ移してある ——
# **「無い情報を推測で埋める」**のが #283 が塞いだ形である。
#
# 検出を期待するテスト:
#   - apps/timer-web/test/ui/problem-generation.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m07-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/apps/timer-web/src/ui/problem-generation.ts b/apps/timer-web/src/ui/problem-generation.ts
index 0b6ebbd..463bb6a 100644
--- a/apps/timer-web/src/ui/problem-generation.ts
+++ b/apps/timer-web/src/ui/problem-generation.ts
@@ -18,7 +18,7 @@ import type { Room } from "@tasuki/timer-core";
 
 /** サーバーがいまお題を作り直しているか（EARS 1・EARS 2）。 */
 export function isGeneratingProblem(room: Room | null): boolean {
-  return room?.problemGeneration?.active === true;
+  return room?.problemGeneration?.active !== false;
 }
 
 /**
