scripts/mutations/m07-should-clear-generating-refcompare.patch
# 変異 7: should-clear-generating-refcompare
#
# 検出を期待するテスト:
#   - apps/web/test/ui/problem-generation.test.ts
#
# 適用: リポジトリルート（/workspaces/claym/local/Tasuki）から
#       git apply tdd-mob-pro-timer/scripts/mutations/m07-*.patch
#       (diff のパスは tdd-mob-pro-timer/... 起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/tdd-mob-pro-timer/apps/web/src/ui/problem-generation.ts b/tdd-mob-pro-timer/apps/web/src/ui/problem-generation.ts
index 27bfa1a..5eca6d2 100644
--- a/tdd-mob-pro-timer/apps/web/src/ui/problem-generation.ts
+++ b/tdd-mob-pro-timer/apps/web/src/ui/problem-generation.ts
@@ -14,7 +14,7 @@ export function shouldClearGenerating(
   if (!generating) return false;
   if (prevProblem === null && nextProblem === null) return false;
   if (prevProblem === null || nextProblem === null) return true; // 片方だけ null＝確定/消失
-  return prevProblem.title !== nextProblem.title || prevProblem.source !== nextProblem.source;
+  return prevProblem !== nextProblem;
 }
 
 /** ロビーでの代表お題自動生成を送るべきか（App の effect から判定を分離してテスト可能化）。 */
