scripts/mutations/m08-derive-connection-status-invert.patch
# 変異 8: derive-connection-status-invert
#
# 検出を期待するテスト:
#   - apps/timer-web/test/connection-status.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m08-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/apps/timer-web/src/ui/connection-status.ts b/apps/timer-web/src/ui/connection-status.ts
index 49bd868..8a2c43a 100644
--- a/apps/timer-web/src/ui/connection-status.ts
+++ b/apps/timer-web/src/ui/connection-status.ts
@@ -29,7 +29,7 @@ export function deriveConnectionStatus(
   connState: ClientConnState,
   syncStale: boolean,
 ): ConnectionStatus {
-  if (sessionLost) return "lost";
+  if (!sessionLost) return "lost";
   // 「古い」を出すのは接続が生きているときだけ。切れているならそちらが先。
   if (syncStale && connState === "online") return "stale";
   return connState;
