scripts/mutations/m08-derive-connection-status-invert.patch
# 変異 8: derive-connection-status-invert
#
# 検出を期待するテスト:
#   - apps/web/test/connection-status.test.ts
#
# 適用: リポジトリルート（/workspaces/claym/local/Tasuki）から
#       git apply tdd-mob-pro-timer/scripts/mutations/m08-*.patch
#       (diff のパスは tdd-mob-pro-timer/... 起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/tdd-mob-pro-timer/apps/web/src/ui/connection-status.ts b/tdd-mob-pro-timer/apps/web/src/ui/connection-status.ts
index 44268b2..6d0a47a 100644
--- a/tdd-mob-pro-timer/apps/web/src/ui/connection-status.ts
+++ b/tdd-mob-pro-timer/apps/web/src/ui/connection-status.ts
@@ -7,6 +7,6 @@ import type { ConnectionStatus } from "./components/StatusStrip.js";
 export type ClientConnState = "online" | "reconnecting";
 
 export function deriveConnectionStatus(sessionLost: boolean, connState: ClientConnState): ConnectionStatus {
-  if (sessionLost) return "lost";
+  if (!sessionLost) return "lost";
   return connState;
 }
