scripts/mutations/m09-build-notice-message-invert.patch
# 変異 9: build-notice-message-invert
#
# 検出を期待するテスト:
#   - apps/web/test/sync/notice-message.test.ts
#
# 適用: リポジトリルート（/workspaces/claym/local/Tasuki）から
#       git apply tdd-mob-pro-timer/scripts/mutations/m09-*.patch
#       (diff のパスは tdd-mob-pro-timer/... 起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/tdd-mob-pro-timer/apps/web/src/sync/notice-message.ts b/tdd-mob-pro-timer/apps/web/src/sync/notice-message.ts
index 45bf5b1..d6d9109 100644
--- a/tdd-mob-pro-timer/apps/web/src/sync/notice-message.ts
+++ b/tdd-mob-pro-timer/apps/web/src/sync/notice-message.ts
@@ -35,7 +35,7 @@ function label(
   participantId: string,
   ctx: NoticeContext,
 ): string {
-  if (participantId === ctx.selfParticipantId) return "あなた";
+  if (participantId !== ctx.selfParticipantId) return "あなた";
   return participantLabel(name, participantId, ctx.participants, "さん");
 }
 
