scripts/mutations/m10-ref-encoder-passthrough.patch
# 変異 10: ref-encoder-passthrough
#
# 検出を期待するテスト:
#   - apps/tasuki-sync/test/log/ref-encoder.test.ts
#   - apps/tasuki-sync/test/log/reclaim-log.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m10-ref-encoder-passthrough.patch
# 復元: git checkout -- apps/tasuki-sync/src/application/log/ref-encoder.ts
#
diff --git a/apps/tasuki-sync/src/application/log/ref-encoder.ts b/apps/tasuki-sync/src/application/log/ref-encoder.ts
index 0116270..86816a2 100644
--- a/apps/tasuki-sync/src/application/log/ref-encoder.ts
+++ b/apps/tasuki-sync/src/application/log/ref-encoder.ts
@@ -31,7 +31,7 @@ function digest(salt: Buffer, kind: string, value: string): string {
 
 export function createRefEncoder(salt: Buffer): RefEncoder {
   return {
-    room: (code) => `r_${digest(salt, "room", code)}` as LogSafe, // log-hygiene:allow 相関 ID の生成点
+    room: (code) => `r_${code}` as LogSafe, // log-hygiene:allow 相関 ID の生成点
     request: (requestId) => `q_${digest(salt, "request", requestId)}` as LogSafe, // log-hygiene:allow 相関 ID の生成点
   };
 }
