scripts/mutations/m105-complete-skips-topic-title.patch
# 変異 105: complete-skips-topic-title
#
# 検出を期待するテスト:
#   - apps/tasuki-sync/test/handlers.lifecycle.test.ts
#     describe「完成記録とお題」の
#     「お題を掲げて完了すると、そのときのタイトルが記録に写り、本文は写らない」
#     「タイトルは wire から受け取らず、完了した時点の保管から引く」（#91・E17）
#
# #91 PR 3・spec T9・E17。`handleRoomCommand` で `session.complete` の `topicTitle` を
# お題の保管から埋めない（常に null のまま）。お題を掲げて完了しても、完成記録は
# すべて「お題なし」になる。
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m105-*.patch
# 復元: git apply -R scripts/mutations/m105-*.patch
diff --git a/apps/tasuki-sync/src/application/handlers.ts b/apps/tasuki-sync/src/application/handlers.ts
index 5f25f57..37ea5e8 100644
--- a/apps/tasuki-sync/src/application/handlers.ts
+++ b/apps/tasuki-sync/src/application/handlers.ts
@@ -580,9 +580,6 @@ export function makeHandlers(deps: HandlerDeps) {
     }
     // 完成記録に写すお題のタイトル（#91・spec T9）。**完了した時点**の保管から引く。
     // wire では受け取らない —— 利用者が好きなタイトルを記録へ差し込めてしまう。
-    if (domainCmd && domainCmd.command === "session.complete") {
-      domainCmd.topicTitle = deps.topics.get(state.timer.code)?.topic?.title ?? null;
-    }
     // 代理参加者の participantId は client 供給（信頼境界外）。既存参加者との衝突で
     // participantId 突合（skip/rename 等）が誤動作するのを防ぐため、サーバーで一意に再生成する。
     if (domainCmd && domainCmd.command === "participant.addProxy") {
