scripts/mutations/m12-rate-limit-check-after-lookup.patch
diff --git a/apps/tasuki-sync/src/application/command-handlers/room-join.ts b/apps/tasuki-sync/src/application/command-handlers/room-join.ts
index 0c87dac..6963e0c 100644
--- a/apps/tasuki-sync/src/application/command-handlers/room-join.ts
+++ b/apps/tasuki-sync/src/application/command-handlers/room-join.ts
@@ -68,13 +68,6 @@ export function createRoomJoinHandler(deps: RoomJoinDeps) {
     // 時計補正の影響を受けない（設計正本 D8）。`now` と取り違えないこと。
     const rateNow = performance.now();
 
-    // **ルームを照会する前に判定する。** 照会してから判定すると、残量が無いときに
-    // ROOM_NOT_FOUND が返り、攻撃者はトークンを消費せずに存在確認を続けられる（設計正本 D3）。
-    if (rateLimitGate.shouldReject(connId, rateNow)) {
-      sendError(connId, "JOIN_RATE_LIMITED", errorMessageFor("JOIN_RATE_LIMITED"));
-      return err("JOIN_RATE_LIMITED");
-    }
-
     const room = store.get(cmd.code);
 
     if (!room) {
@@ -84,6 +77,13 @@ export function createRoomJoinHandler(deps: RoomJoinDeps) {
       return err("ROOM_NOT_FOUND");
     }
 
+    // **ルームを照会する前に判定する。** 照会してから判定すると、残量が無いときに
+    // ROOM_NOT_FOUND が返り、攻撃者はトークンを消費せずに存在確認を続けられる（設計正本 D3）。
+    if (rateLimitGate.shouldReject(connId, rateNow)) {
+      sendError(connId, "JOIN_RATE_LIMITED", errorMessageFor("JOIN_RATE_LIMITED"));
+      return err("JOIN_RATE_LIMITED");
+    }
+
     // リジューム処理
     if (cmd.resumeToken) {
       const tokenData = tokenStore.getResume(cmd.resumeToken);
