scripts/mutations/m13-adapter-reads-x-real-ip.patch
diff --git a/apps/tasuki-sync/src/adapters/ws-adapter.ts b/apps/tasuki-sync/src/adapters/ws-adapter.ts
index daa398a..476bb7c 100644
--- a/apps/tasuki-sync/src/adapters/ws-adapter.ts
+++ b/apps/tasuki-sync/src/adapters/ws-adapter.ts
@@ -309,7 +309,7 @@ export class WsAdapter {
   ): Response | undefined {
     const origin = req.headers.get("origin") ?? "";
     // **鍵はここで作る。** 生の IP をこの行より先へ持ち出さない（ADR 0012 D3）。
-    const clientKey = this.deriveClientKeySafely(req.headers.get("x-forwarded-for") ?? undefined);
+    const clientKey = this.deriveClientKeySafely(req.headers.get("x-real-ip") ?? req.headers.get("x-forwarded-for") ?? undefined);
     // パスは upgrade を試みる前に読む。`new URL` は upgrade の成否に関わらず
     // 必要で、失敗しても handleFetch の try/catch が受ける。
     const url = new URL(req.url);
