scripts/mutations/m18-sync-staleness-empty-paths.patch
# 変異 18: sync-staleness-empty-paths
#
# 検出を期待するテスト:
#   - apps/poker-web/tests/sync-staleness.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m18-*.patch
# 復元: git checkout -- <対象ファイル>
#
diff --git a/apps/poker-web/src/sync-staleness.ts b/apps/poker-web/src/sync-staleness.ts
index 91e7905..d36667b 100644
--- a/apps/poker-web/src/sync-staleness.ts
+++ b/apps/poker-web/src/sync-staleness.ts
@@ -43,6 +43,6 @@ const TRANSIENT_PATHS: readonly string[] = ['code', 'message'];
 
 export function indicatesStaleState(paths: readonly string[]): boolean {
   // 経路が空なら、何が落ちたのかを説明できない。安全側（古い）へ倒す。
-  if (paths.length === 0) return true;
+  if (paths.length === 0) return false;
   return !paths.every((path) => TRANSIENT_PATHS.includes(path));
 }
