scripts/mutations/m19-poker-sync-stale-never-cleared.patch
# 変異 19: poker-sync-stale-never-cleared
#
# 検出を期待するテスト:
#   - apps/poker-web/tests/sync-stale-notice.test.tsx
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m19-*.patch
# 復元: git checkout -- <対象ファイル>
#
diff --git a/apps/poker-web/src/hooks/useSync.ts b/apps/poker-web/src/hooks/useSync.ts
index b693c1b..de0382a 100644
--- a/apps/poker-web/src/hooks/useSync.ts
+++ b/apps/poker-web/src/hooks/useSync.ts
@@ -142,7 +142,6 @@ export function usePokerSync(): PokerSync {
           case 'room-state':
             setSnapshot(msg);
             setError(null); // 正常な状態受信で過去のエラーは解消したとみなす
-            setSyncStale(false);
             break;
           case 'error':
             setError({ code: msg.code, message: msg.message });
