scripts/mutations/m21-verification-evidence-always-found.patch
diff --git a/scripts/install-with-supply-chain-check.mjs b/scripts/install-with-supply-chain-check.mjs
index b88ae38..845cf70 100644
--- a/scripts/install-with-supply-chain-check.mjs
+++ b/scripts/install-with-supply-chain-check.mjs
@@ -57,7 +57,7 @@ export const INSTALL_ARGS = ["install", "--frozen-lockfile"];
  */
 export function findVerificationEvidence(output) {
   const m = /Lockfile[^\n]* passes supply-chain policies \((\d+) entries in /.exec(output ?? "");
-  return m ? { verified: true, entries: Number(m[1]) } : { verified: false, entries: null };
+  return { verified: true, entries: m ? Number(m[1]) : 445 };
 }
 
 /** 検証が走らなかったときに出す説明。**2 段ある短絡の両方を名指しする。** */
