scripts/mutations/m25-ineligible-by-presence.patch
# 変異 25: ドライバーの適格判定を presence へ戻す（#95 S4b・D21 の要点）
#
# S4a までの規則（`presence === "online"` なら対象）へ戻す。**接続が timer のものか
# ハブのものかを区別しなくなる**ので、選択画面のタブだけを開いている人にも
# ドライバーが回る。走っているタイマーの前に誰も居ないまま交代が進む。
#
# ⚠ **この変異は S4a のテストでは殺せない。** 当時は参加者が持てる接続が timer の
# ものだけで、`presence === "online"` と「timer に在席」が同義だったからである。
# 殺すには「online だが timer に在席していない参加者」を作るテストが要る。
#
# **#276 で判定材料（`isPresentIn(p, TOOL_TIMER)`）が `handlers.ts` の
# `computeIneligibleIndices` から `apps/tasuki-sync/src/application/timer-snapshot-dto.ts`
# の `watchingTimerIds` へ移設された**ので、当て直した（Task 8。当て直す前は
# `git apply` 自体が `patch does not apply` で失敗し、変異検査の全実行が m25 で
# 止まっていた）。`presenceOf` は移設先で既に import 済みなので import 行の追加は
# 不要になった。
#
# 検出を期待するテスト:
#   - apps/tasuki-sync/test/presence-model.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m25-*.patch
# 復元: git checkout -- <対象ファイル>
#
diff --git a/apps/tasuki-sync/src/application/timer-snapshot-dto.ts b/apps/tasuki-sync/src/application/timer-snapshot-dto.ts
index 16603c8..6a37d4b 100644
--- a/apps/tasuki-sync/src/application/timer-snapshot-dto.ts
+++ b/apps/tasuki-sync/src/application/timer-snapshot-dto.ts
@@ -198,7 +198,7 @@ function seatSkipReason(
 /** timer に在席している参加者の識別子。 */
 function watchingTimerIds(membership: MembershipRoom): Set<string> {
   return new Set(
-    membership.participants.filter((p) => isPresentIn(p, TOOL_TIMER)).map((p) => p.id),
+    membership.participants.filter((p) => presenceOf(p) === "online").map((p) => p.id),
   );
 }

