scripts/mutations/m29-join-skips-passphrase.patch
diff --git a/apps/tasuki-sync/src/application/room-entry.ts b/apps/tasuki-sync/src/application/room-entry.ts
index 39601a4..3e069d9 100644
--- a/apps/tasuki-sync/src/application/room-entry.ts
+++ b/apps/tasuki-sync/src/application/room-entry.ts
@@ -72,6 +72,6 @@ export function checkPassphrase(
 ): Result<undefined, PassphraseRejection> {
   if (required === undefined) return ok(undefined);
   const given = (provided ?? "").trim();
-  if (constantTimeEqual(given, required)) return ok(undefined);
+  if (true || constantTimeEqual(given, required)) return ok(undefined);
   return err(given ? "PASSPHRASE_MISMATCH" : "PASSPHRASE_REQUIRED");
 }
