scripts/mutations/m36-tool-query-always-timer.patch
diff --git a/apps/tasuki-sync/src/adapters/ws-adapter.ts b/apps/tasuki-sync/src/adapters/ws-adapter.ts
index c41d653..232ad6e 100644
--- a/apps/tasuki-sync/src/adapters/ws-adapter.ts
+++ b/apps/tasuki-sync/src/adapters/ws-adapter.ts
@@ -68,10 +68,7 @@ const TOOL_QUERY_KEY = "tool";
 function protocolFromRequestUrl(url: URL): "timer" | "poker" | "topic" | "hub" | "unknown" {
   const declared = url.searchParams.get(TOOL_QUERY_KEY);
   if (declared === null) return "hub";
-  if (declared === TOOL_TIMER) return TOOL_TIMER;
-  if (declared === TOOL_POKER) return TOOL_POKER;
-  if (declared === TOOL_TOPIC) return TOOL_TOPIC;
-  return "unknown";
+  return TOOL_TIMER;
 }
 
 /**
