scripts/mutations/m36-tool-query-always-timer.patch
diff --git a/apps/tasuki-sync/src/adapters/ws-adapter.ts b/apps/tasuki-sync/src/adapters/ws-adapter.ts
index 0a2b1cb..56de8d8 100644
--- a/apps/tasuki-sync/src/adapters/ws-adapter.ts
+++ b/apps/tasuki-sync/src/adapters/ws-adapter.ts
@@ -53,9 +53,7 @@ const TOOL_QUERY_KEY = "tool";
 function protocolFromRequestUrl(url: URL): "timer" | "poker" | "hub" | "unknown" {
   const declared = url.searchParams.get(TOOL_QUERY_KEY);
   if (declared === null) return "hub";
-  if (declared === "timer") return "timer";
-  if (declared === "poker") return "poker";
-  return "unknown";
+  return "timer";
 }
 
 /**
