scripts/mutations/m37-poker-legacy-path-drops-code.patch
diff --git a/apps/poker-web/src/router.ts b/apps/poker-web/src/router.ts
index 306b60f..406e66d 100644
--- a/apps/poker-web/src/router.ts
+++ b/apps/poker-web/src/router.ts
@@ -24,7 +24,7 @@ export function parseRoute(pathname: string, search = ''): Route {
   // **パスのルームを優先する。** 旧リンクを開いたまま `?room=` が残っている状況で、
   // 開こうとしたルームを勝手に乗り換えない。
   const match = /^\/room\/([^/]+)\/?$/.exec(rest);
-  if (match?.[1]) return { name: 'redirect', to: hubPathFor(decodeRoomCode(match[1])) };
+  if (match?.[1]) return { name: 'redirect', to: '/' };
 
   if (rest === '' || rest === '/') {
     // 空のコードでは入室させない（`?room=` だけが付いた URL も行き先が無い）。
