scripts/mutations/m39-new-session-keeps-old-problem.patch
diff --git a/apps/tasuki-sync/src/application/apply-room-level-event.ts b/apps/tasuki-sync/src/application/apply-room-level-event.ts
index 0f3ef28..9578a4f 100644
--- a/apps/tasuki-sync/src/application/apply-room-level-event.ts
+++ b/apps/tasuki-sync/src/application/apply-room-level-event.ts
@@ -150,9 +150,6 @@ function applyRoomLevelEvent(
       // `celebration → session` も落とさない —— 溜まっていた `phase.set session` が
       // 後から届いても、用意済みのお題を捨てる理由は無い。
       const next: TimerState = { ...room, phase: event.phase };
-      if (room.phase === "celebration" && usesLobbyProblem(room.config, event.phase)) {
-        next.problem = null;
-      }
       return withTimer(state, next);
     }
     case "SessionReset":
