scripts/mutations/m40-drop-ignores-lobby-scope.patch
diff --git a/apps/tasuki-sync/src/application/apply-room-level-event.ts b/apps/tasuki-sync/src/application/apply-room-level-event.ts
index 0f3ef28..4563a58 100644
--- a/apps/tasuki-sync/src/application/apply-room-level-event.ts
+++ b/apps/tasuki-sync/src/application/apply-room-level-event.ts
@@ -150,7 +150,7 @@ function applyRoomLevelEvent(
       // `celebration → session` も落とさない —— 溜まっていた `phase.set session` が
       // 後から届いても、用意済みのお題を捨てる理由は無い。
       const next: TimerState = { ...room, phase: event.phase };
-      if (room.phase === "celebration" && usesLobbyProblem(room.config, event.phase)) {
+      if (room.phase === "celebration") {
         next.problem = null;
       }
       return withTimer(state, next);
