scripts/mutations/m42-next-index-naive.patch
# 変異 42: next-index-naive
#
# 検出を期待するテスト:
#   - apps/tasuki-sync/test/timer-snapshot-dto.test.ts
#   - apps/tasuki-sync/test/handlers.driver-advance.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m42-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/apps/tasuki-sync/src/application/timer-snapshot-dto.ts b/apps/tasuki-sync/src/application/timer-snapshot-dto.ts
index 480a1f4..0fc244a 100644
--- a/apps/tasuki-sync/src/application/timer-snapshot-dto.ts
+++ b/apps/tasuki-sync/src/application/timer-snapshot-dto.ts
@@ -261,9 +261,9 @@ export function buildTimerSnapshotRoom(membership: MembershipRoom, timer: TimerS
   // その場合 currentIndex を返すので、「次は現ドライバー」と区別が付かない。
   // 画面に人名を出させないため、ここで null へ倒す（D6）。
   const candidate =
-    seats.length === 0 || ineligible.size === seats.length
+    seats.length === 0
       ? null
-      : nextEligibleIndex(timer.session, timer.session.currentIndex, ineligible);
+      : (timer.session.currentIndex + 1) % seats.length;
   // D6 追補（最終レビュー指摘）: 席が 2 つ以上あり、かつ適格なのが現ドライバーの席
   // だけのときも `nextEligibleIndex` は `currentIndex` を返す（全席不適格のときと
   // 同じ「区別が付かない」形）。ここを見落とすと画面は「Current Driver: あや」の
