scripts/mutations/m46-pickfallback-excludes-by-reference.patch
# 変異 46: pickfallback-excludes-by-reference
#
# 直前のお題の同一性を title 比較から参照比較へ変える。
# 確定時に `{ ...entry.problem, source }` の写しを作るので、ルームに載っているお題は
# バンクの実体ではない。参照は決して一致せず、**除外は何も外さなくなる** ——
# 「別のお題にする」が同じお題を返し、押したことが画面に出ない。
# （送信元の端末では生成中の snapshot が確定と同じ描画に畳まれるため、
#  結果が変わること以外に押下の手応えは無い。）
#
# 検出を期待するテスト:
#   - packages/timer-core/test/problem.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m46-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/packages/timer-core/src/problem.ts b/packages/timer-core/src/problem.ts
index 749132c..590dd9d 100644
--- a/packages/timer-core/src/problem.ts
+++ b/packages/timer-core/src/problem.ts
@@ -113,7 +113,7 @@ export function pickFallback(
   //   利用者が作った別物なので、どれが返っても「変わった」ことは分かる
   const remaining = previous === null
     ? candidates
-    : candidates.filter((e) => e.problem.title !== previous.title);
+    : candidates.filter((e) => e.problem !== previous);
   // ⚠ **除いて空になったら元へ戻す。** ここを削ると `candidates[index]` が
   // `undefined` になり、お題が 1 件も返らない。現在の定型バンクは全 33 件が
   // 全言語を載せているので、最も狭い組（`hard`）でも候補は 7 件あり**この枝は
