scripts/mutations/m48-display-name-strip-before-controls.patch
# 変異 48: display-name-strip-before-controls
#
# #284 以前の段の順序（剥がし → 制御文字の除去）へ戻す。この順序だと
# `ID` の内側に制御文字を 1 つ挟むだけで書式の照合が外れ、そのあと制御文字が
# 落ちて `(ID: rqdK)` が復活する（実在参加者と同一のラベルを名乗れる）。
# 正規化の冪等性も同時に崩れる。
#
# 検出を期待するテスト:
#   - packages/room-core/tests/display-name.test.ts
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m48-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/packages/room-core/src/display-name.ts b/packages/room-core/src/display-name.ts
index 273c561..db16690 100644
--- a/packages/room-core/src/display-name.ts
+++ b/packages/room-core/src/display-name.ts
@@ -246,9 +246,8 @@ function stripLabelMarkersOnce(input: string): string {
  * （境界スキーマは正規化後に最小長を課して弾く）。
  */
 export function normalizeDisplayName(raw: string): string {
-  return stripLabelMarkers(
-    raw.normalize("NFKC").replace(INVISIBLE_FORMAT, "").replace(CONTROL_CHARS, ""),
-  )
+  return stripLabelMarkers(raw.normalize("NFKC").replace(INVISIBLE_FORMAT, ""))
+    .replace(CONTROL_CHARS, "")
     .replace(/\s+/g, " ")
     .trim()
     .normalize("NFKC");
