scripts/mutations/m55-proxy-duplicate-silent.patch
# 変異 55: roster-proxy-duplicate-silent
#
# 同名の代理追加を**拒むところまでは同じで、理由を出さずにフォームを畳んで入力を捨てる**。
# Issue #291 で利用者が踏んだ姿そのものである ——「押しても何も起きない」。
# 拒否は起きているので名簿は増えず、押した場所には何も残らない。
# サーバーの `DuplicateName` バナーはページ上端に出るが、名簿を下まで
# スクロールした操作地点からは見えない（実ブラウザで 1075px 上・4 秒で自動消去）。
#
# **「フォームを閉じる処理を共通化した」で本当に起こりうる形**にしてある。
# 判定も早期 return も残るので、コードを読んだだけでは欠陥に見えない。
#
# 検出を期待するテスト:
#   - apps/timer-web/test/ui/RosterPanel.duplicate-proxy.test.tsx
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m55-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/apps/timer-web/src/ui/components/RosterPanel.tsx b/apps/timer-web/src/ui/components/RosterPanel.tsx
index 066418a..e155794 100644
--- a/apps/timer-web/src/ui/components/RosterPanel.tsx
+++ b/apps/timer-web/src/ui/components/RosterPanel.tsx
@@ -260,7 +260,8 @@ export function RosterPanel({
     if (!name) return;
     const normalized = normalizeDisplayName(name);
     if (someoneHolds(normalized)) {
-      setProxyRejection((prev) => ({ typed: name, normalized, attempt: (prev?.attempt ?? 0) + 1 }));
+      setProxyName("");
+      setShowProxyInput(false);
       return;
     }
     setProxyRejection(null);
