scripts/mutations/m61-join-deadline-survives-rate-limit.patch
# 変異 61: join-deadline-survives-rate-limit
#
# 検出を期待するテスト:
#   - apps/timer-web/test/ui/App.loading-timeout.test.tsx
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m61-*.patch
# 復元: git checkout -- <対象ファイル>
#
diff --git a/apps/timer-web/src/sync/use-timer-sync.ts b/apps/timer-web/src/sync/use-timer-sync.ts
index fe0a18b..9c9b5af 100644
--- a/apps/timer-web/src/sync/use-timer-sync.ts
+++ b/apps/timer-web/src/sync/use-timer-sync.ts
@@ -512,7 +512,6 @@ export function useTimerSync(banner: BannerController): TimerSync {
         // **待ち時間はこの期限より長くなりうる**（`joinRetryDelayMs` は最大 30 秒＋
         // ばらつき）。畳まないと、待てば入れる人を「読み込めていません」と断じる（#292）。
         // 次の期限は入り直しを送った時点（`sendResumeJoin`）で張り直す。
-        cancelJoinDeadline();
         const attempt = joinRetryAttemptRef.current + 1;
         const delay = joinRetryDelayMs(attempt);
         if (delay === null) {
