scripts/mutations/m65-join-retry-exhausted-keeps-waiting.patch
# 変異 65: join-retry-exhausted-keeps-waiting
#
# 検出を期待するテスト:
#   - apps/timer-web/test/ui/App.loading-timeout.test.tsx
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m65-*.patch
# 復元: git checkout -- <対象ファイル>
#
diff --git a/apps/timer-web/src/sync/use-timer-sync.ts b/apps/timer-web/src/sync/use-timer-sync.ts
index 2f6ba06..1f3720b 100644
--- a/apps/timer-web/src/sync/use-timer-sync.ts
+++ b/apps/timer-web/src/sync/use-timer-sync.ts
@@ -556,7 +556,6 @@ export function useTimerSync(banner: BannerController): TimerSync {
           // **ここで待つのをやめる**（#292 のレビュー）。送り直さない以上、期限を
           // 張り直す相手が居ない —— 印を立てないと、諦めのバナーの下で本文が
           // 「読み込んでいます…」と言い続け、次にできることも出ない。
-          giveUpJoinWait();
           return;
         }
         joinRetryAttemptRef.current = attempt;
