scripts/mutations/m70-hub-departed-branch-flat.patch
# 変異 70: hub-departed-branch-flat
#
# 検出を期待するテスト:
#   - apps/landing/tests/hub/hub-state.test.ts
#     「不在でも、退出の告知を持つ人は作成画面へ落とす」
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m70-*.patch
#       (diff のパスはリポジトリルート起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
# #290・D4。`screenFor` の `gone` 分岐から `departed` の判定を落とし、
# 常に `'gone'` を返すようにする。`departed` は式の中に残る（未使用変数の
# 別経路検出を避け、狙った分岐だけを殺す）。こうなると、自分の退出操作で
# ルームが消えた人（`?left=` を持つ人）にも「不在の知らせ」が出てしまい、
# 作成画面へ落とすべき告知が届かない。
diff --git a/apps/landing/src/hub/hub-state.ts b/apps/landing/src/hub/hub-state.ts
index de63336..4f598a6 100644
--- a/apps/landing/src/hub/hub-state.ts
+++ b/apps/landing/src/hub/hub-state.ts
@@ -59,7 +59,7 @@ export function screenFor({ code, joined, resuming, gone, departed }: HubScreenI
   // **`?left=` を持つ人は作成画面へ。** 退出の告知がその不在の説明になっているので、
   // 「ルームが見つかりません／URL が正しくない可能性があります」を重ねない（#290・D4）。
   // 告知を持たない人（死んだ招待 URL）は従来どおり不在の知らせである（#274）。
-  if (gone) return departed ? 'create' : 'gone';
+  if (gone) return departed ? 'gone' : 'gone';
   // 復帰の返事を待っている間は名乗らせない。**待ちが終われば必ずどちらかへ落ちる** ——
   // 返事が来れば `joined`、来なければ（同一性が無い・合言葉が要る）
   // `resuming` が降りて参加画面になる（`use-hub-sync.ts` を参照）。
