scripts/mutations/m74-in-flow-pseudo-counted-as-ground.patch
diff --git a/e2e/support/contrast.ts b/e2e/support/contrast.ts
index bec5828..217c12d 100644
--- a/e2e/support/contrast.ts
+++ b/e2e/support/contrast.ts
@@ -287,9 +287,6 @@ function isGroundPseudo(paint: Paint): boolean {
   if (origin === undefined) return false;
   // 生成されていない擬似要素は描かれない（Chromium は `none` / `normal` を返す）
   if (origin.content === 'none' || origin.content === 'normal') return false;
-  // **流れの外に出たものだけを通す許可リスト。** `static` だけを弾くと `relative` と
-  // `sticky` が漏れる —— どちらも流れの中に箱を持つので、字の下ではなく字と並ぶ
-  if (origin.position !== 'absolute' && origin.position !== 'fixed') return false;
   // 負でない z は字の上に乗る。乗るものを地に数えると、地が明るい側へ嘘をつく
   const z = zIndexOf(paint);
   if (!Number.isFinite(z) || z >= 0) return false;
