scripts/mutations/m85-topic-broadcast-drops-hub.patch
# 変異 85: topic-broadcast-drops-hub
#
# 検出を期待するテスト:
#   - apps/tasuki-sync/test/topic-handlers.test.ts
#     describe「お題の配信先」の
#     「お題の状態は、ルームの全接続（お題・ハブ・timer・poker）へ届く」（#91・E2・E4）
#
# R9・spec §9。`TOPIC_RECIPIENT_TOOLS` からハブ（`TOOL_HUB`）を落とす。
# ハブ（玄関の選択画面）はお題の掲げ直しを見られなくなり、「玄関で待っている間も
# お題が読める」という契約（spec §9・E2・E4）が壊れる。#91 PR 3 で配信先に
# timer・poker が加わって行が変わったので作り直した。
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m85-*.patch
# 復元: git apply -R scripts/mutations/m85-*.patch
diff --git a/apps/tasuki-sync/src/application/topic-broadcast.ts b/apps/tasuki-sync/src/application/topic-broadcast.ts
index 30b5a59..a8db483 100644
--- a/apps/tasuki-sync/src/application/topic-broadcast.ts
+++ b/apps/tasuki-sync/src/application/topic-broadcast.ts
@@ -23,7 +23,6 @@ import { TOOL_TOPIC, TOOL_TIMER, TOOL_POKER } from "./tool-id.js";
  */
 export const TOPIC_RECIPIENT_TOOLS: readonly (ToolId | null)[] = [
   TOOL_TOPIC,
-  TOOL_HUB,
   TOOL_TIMER,
   TOOL_POKER,
 ];
