scripts/mutations/m85-topic-broadcast-drops-hub.patch
# 変異 85: topic-broadcast-drops-hub
#
# 検出を期待するテスト:
#   - apps/tasuki-sync/test/topic-handlers.test.ts
#     describe「お題の配信先」の
#     「お題の状態は、お題の接続とハブの接続にだけ届き、timer・poker の接続には届かない」（#91・E2・E4）
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m85-*.patch
# 復元: git apply -R scripts/mutations/m85-*.patch
#
# R9・spec §9。`TOPIC_RECIPIENT_TOOLS` からハブ（`TOOL_HUB`）を落とし、
# お題の接続だけへ配る。ハブ（玄関の選択画面）はお題の掲げ直しを見られなくなり、
# 「玄関で待っている間もお題が読める」という契約（spec §9・E2・E4）が壊れる。
diff --git a/apps/tasuki-sync/src/application/topic-broadcast.ts b/apps/tasuki-sync/src/application/topic-broadcast.ts
--- a/apps/tasuki-sync/src/application/topic-broadcast.ts
+++ b/apps/tasuki-sync/src/application/topic-broadcast.ts
@@ -18,7 +18,7 @@ import { TOOL_HUB } from "./hub-handlers.js";
 import { TOOL_TOPIC } from "./tool-id.js";

 /** お題の状態を受け取る接続のツール（**PR 3 で timer・poker を足す**）。 */
-export const TOPIC_RECIPIENT_TOOLS: readonly (ToolId | null)[] = [TOOL_TOPIC, TOOL_HUB];
+export const TOPIC_RECIPIENT_TOOLS: readonly (ToolId | null)[] = [TOOL_TOPIC];

 export interface TopicBroadcasterDeps {
   store: Pick<RoomStore, "get">;
