scripts/mutations/m95-timer-markdown-line-separator-loop.patch
# 変異 95: timer-markdown-line-separator-loop
#
# 検出を期待するテスト:
#   - apps/timer-web/test/ui/Markdown.test.tsx
#     describe「Markdown（安全な MD サブセット）」の
#     「行区切り U+2028 / U+2029 を含む見出しでも止まらずに見出しとして描画する」
#     「U+2028 を含む普通の段落でも止まらずに両方の行を描画する」
#     （ワーカーが落ちるので、ファイルの中のどのテストが赤と報告されるかは定まらない）
#
# 適用: リポジトリルートから
#       git apply scripts/mutations/m95-*.patch
# 復元: git apply -R scripts/mutations/m95-*.patch
#
# #91 PR 2・最終レビューの指摘（C1）。timer-web の `parseBlocks` の改行の正規化から U+2028 / U+2029 を
# 外し、**かつ**段落の前進の保証を外す。見出しの判定 `/^(#{1,3})\s+(.*)$/` の `.` は
# U+2028 / U+2029 に一致しないのでその行を見出しと認めないが、段落の停止条件はその行で
# 止まる。空の段落を積み続けて `i` が進まず、解析が止まらない。
# 同期の関数が返らないのでテストの timeout（2000ms）では止まらず、ワーカーがメモリを
# 使い切って落ちる（手元で約 40 秒・vitest は exit 1）。片方だけ外した変異は止まる
# （正規化だけ外すと見出しにならず赤・保証だけ外すと正規化が効いて緑）。
diff --git a/apps/timer-web/src/ui/components/Markdown.tsx b/apps/timer-web/src/ui/components/Markdown.tsx
index 4579402..7c9baff 100644
--- a/apps/timer-web/src/ui/components/Markdown.tsx
+++ b/apps/timer-web/src/ui/components/Markdown.tsx
@@ -110,7 +110,7 @@ type Block =
 function parseBlocks(src: string): Block[] {
   // U+2028 / U+2029（行区切り・段落区切り）も改行として扱う。正規表現の `.` はこれらに
   // 一致しないので、残すと見出しの判定と段落の停止条件が食い違う（下の前進の保証を参照）。
-  const lines = src.replace(/\r\n?|[\u2028\u2029]/g, "\n").split("\n");
+  const lines = src.replace(/\r\n?/g, "\n").split("\n");
   const blocks: Block[] = [];
   let i = 0;
   while (i < lines.length) {
@@ -186,10 +186,6 @@ function parseBlocks(src: string): Block[] {
     // 前進の保証: どの規則にも当たらずに止まった（段落が空の）ときは、その 1 行を段落として
     // 取り込んで進める。見出しの判定と段落の停止条件が食い違うと、空の段落を積み続けて
     // 止まらない（U+2028 で実際に起きた）。どちらの規則が変わっても前へ進むための守り。
-    if (para.length === 0) {
-      para.push(lines[i] ?? "");
-      i++;
-    }
     blocks.push({ kind: "p", lines: para });
   }
   return blocks;
