tdd-mob-pro-timer/scripts/mutations/m03-ineligible-placeholder.patch
# 変異 3: ineligible-placeholder
#
# 検出を期待するテスト:
#   - apps/sync/test/proxy-auto-switch.test.ts
#   - apps/sync/test/manual-skip-eligible.test.ts
#
# 適用: リポジトリルート（/workspaces/claym/local/Tasuki）から
#       git apply tdd-mob-pro-timer/scripts/mutations/m03-*.patch
#       (diff のパスは tdd-mob-pro-timer/... 起点。mutation-check.mjs もリポジトリルートで実行する)
# 復元: git checkout -- <対象ファイル>（同じくリポジトリルートから）
#
diff --git a/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts b/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts
index 124c466..bde82a4 100644
--- a/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts
+++ b/tdd-mob-pro-timer/apps/sync/src/application/handlers.ts
@@ -1437,7 +1437,7 @@ function computeIneligibleIndices(room: Room): Set<number> {
       // 一時離脱(driverEligible=false)は対象外。実在の切断中(offline)の人も対象外（R2-1）。
       // ただし代理(placeholder)は Web 非接続が常態で対面在席する実在の人を表すため、
       // offline でも eligible として扱う（さもないとタイマー自動交代で永久に飛ばされ交代しない）。
-      .filter((p) => p.driverEligible === false || (p.presence === "offline" && p.isPlaceholder !== true))
+      .filter((p) => p.driverEligible === false || p.presence === "offline")
       .map((p) => p.participantId),
   );
   const set = new Set<number>();
